# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
#  Time             2018/9/7 11:21 AM                               
#  Author           purplecity                                       
#  Name             python_cookbook_8_5.py                                    
#  Description                                                    
# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

#命名规范的问题。_ 内部实现。并不会真的组织别人访问内部名称  __继承——这种属性通过继承是无法被覆盖的  #有时候你定义的一个变量和某个保留关键字冲突，这时候可以使用单下划线作为后缀 不如lambda_