# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
#  Time             2018/9/23 4:14 PM                               
#  Author           purplecity                                       
#  Name             python_cookbook_11_5.py                                    
#  Description                                                    
# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

# 我们使用flask

# 11-6  11-8 又是简单的远程调用 跟10.10 10.11一样最后看吧

# 11-7
#multiprocessing.connection  解释器之间的通信


# 。 如果密钥不对会产生一个异常。此外，该模块最适合用来建立长连接（而不是大量的短连接）， 例如，两个解释器之间启动后就开始建立连接并在处理某个问题过程中会一直保持连接状态。
# 基本上用不到