# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
#  Time             2018/9/23 5:17 PM                               
#  Author           purplecity                                       
#  Name             python_cookbook_11_11.py                                    
#  Description                                                    
# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

#   11。7 -- 11.11是python的进程间通信。暂时不看吧。要看也是专题来搞
# 11-12异步io

#  远程调用
# ssl 私钥公钥 消息签名相关
# 进程间通信  感觉这些涉及到这个的话就直接用c吧。没必要Python了。倒是可以参考python这方面的源码写c相关的东东。诶还是看看吧
# 事件驱动IO

